<?php

/*
|--------------------------------------------------------------------------
| Web Routes
|--------------------------------------------------------------------------
|
| Here is where you can register web routes for your application. These
| routes are loaded by the RouteServiceProvider within a group which
| contains the "web" middleware group. Now create something great!
|
 */

//====================================================================== 首页
Route::get('/', 'IndexController@index');

//====================================================================== 登录注册
//============================================================ 注册
Route::get('/register/', 'UserController@register');
//============================================================ 登录
Route::get('/login/', 'UserController@login');
//============================================================ 登出
Route::get('/logout/', 'UserController@logout');
//============================================================ 验证码
Route::get('/sms/', 'HelperController@sms');
//============================================================ 个人中心
Route::get('/user/center/', 'UserController@center');
//============================================================ 个人资料
Route::get('/user/', 'UserController@show');

//====================================================================== 店铺
//============================================================ 店铺
Route::get('/shop/{id}/', 'ShopController@show');
//============================================================ 商家商品列表
Route::get('/shop/{id}/goods/', 'ShopController@goods');

//====================================================================== 商品
//============================================================ 商品
Route::get('/item/{id}/', 'ItemController@show');

//====================================================================== 购物车
//============================================================ 购物车列表
Route::get('/cart/', 'CartController@index');

//====================================================================== 订单
//============================================================ 下单确认页面
Route::get('/order/commit/', 'OrderController@commit');
//============================================================ 订单列表
Route::get('/orders/', 'OrderController@index');
//============================================================ 订单详情
Route::get('/order/{id}/', 'OrderController@show');
//============================================================ 订单物流
Route::get('/order/{id}/express/', 'OrderController@express');
